Autodesk.Revit.DB.Analysis.ViewHVACLoadsReport.IsAnalysisCompleted
Indicates if the heating and cooling loads analysis has completed or not.
Returns:
True if completed, otherwise false.
Since:
2027

Autodesk.Revit.DB.Analysis.ViewHVACLoadsReport.RunLoadsAnalysis
Performs a heating and cooling loads analysis for zones and spaces in the energy model.
Remarks:
Should be called from a transaction.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
A valid energy model is required for loads analysis.
Since:
2027

Autodesk.Revit.DB.Analysis.ViewHVACLoadsReport.Create(Autodesk.Revit.DB.Document,System.String)
Factory method to create a new instance of DBViewHVACLoadsReport.
document:
The document where the report view is to be created.
viewName:
The name of the new report view.
Returns:
The newly created view instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
viewName cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
viewName is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2027

Autodesk.Revit.DB.Analysis.ViewHVACLoadsReport
Represents a loads report instance.
Since:
2027